Repository: python/pootle-python-org-backup
Catalog: tmxes/pl/library.tmx
Source language: en
Languages: pl

source: This method checks if there is a breakpoint in the filename of the current frame.
pl: Ten sposób postępowania sprawdza czy jest punkt przerywania wykonania programu w nazwie pliku obecnej ramki.

source: Derived classes should override these methods to gain control over debugger operation.
pl: Dziedziczone uogólnienia powinny przesłaniać te sposoby postępowania aby zyskać kontrolę ponad operacją odpluskwiania.

source: This method is called from :meth:`dispatch_call` when there is the possibility that a break might be necessary anywhere inside the called function.
pl: Ten sposób postępowania jest wywoływany z :meth:`dispatch_call` gdy jest możliwość że przerwanie programu może być konieczne gdzieś wewnątrz wywoływanego zadania.

source: This method is called from :meth:`dispatch_line` when either :meth:`stop_here` or :meth:`break_here` yields True.
pl: Ten sposób postępowania jest wywoływany z :meth:`dispatch_line` gdy albo :meth:`stop_here` albo :meth:`break_here` zwraca Prawdę.

source: This method is called from :meth:`dispatch_return` when :meth:`stop_here` yields True.
pl: Ten sposób postępowania jest wywoływany ze sposobu postępowania :meth:`dispatch_return` gdy :meth:stop_here` daje Prawdę - z ang. - True.

source: This method is called from :meth:`dispatch_exception` when :meth:`stop_here` yields True.
pl: Ten sposób postępowania jest wywoływany z :meth:`dispatch_exception` gdy :meth:`stop_here` zwraca Prawdę.

source: Handle how a breakpoint must be removed when it is a temporary one.
pl: Obsługuje jak punkt zatrzymania musi być usunięty gdy jest tymczasowym.

source: This method must be implemented by derived classes.
pl: Ten sposób postępowania musi być wypełniony przez odziedziczone uogólnienie.

source: Derived classes and clients can call the following methods to affect the stepping state.
pl: Dziedziczące uogólnienia i klienci mogą wywoływać następujące sposoby postępowania aby wpływać na stan przechodzenia krok-po-kroku.

source: Stop after one line of code.
pl: Zatrzymaj się po jednej linii kodu.

source: Stop on the next line in or below the given frame.
pl: Zatrzymaj się po następnej linii w lub poniżej danej ramki.

source: Stop when returning from the given frame.
pl: Zatrzymaj się gdy następuje powrót z danej ramki.

source: Stop when the line with the line no greater than the current one is reached or when returning from current frame
pl: Zatrzymaj się gdy linia nie większa niż obecna jest osiągana lub gdy następuje powrót z obecnej ramki.

source: Start debugging from *frame*. If *frame* is not specified, debugging starts from caller's frame.
pl: Zacznij odpluskwianie z *ramki*. Jeśli *ramka* jest nieokreślona, odpluskwianie zaczyna od ramki wywołującego.

source: Stop only at breakpoints or when finished. If there are no breakpoints, set the system trace function to None.
pl: Zatrzymaj się tylko na punktach przerywania wykonania programu lub gdy zakończono. Jeśli nie ma punktów przerywania, ustaw zadanie śledzenia systemowego na None.

source: Set the :attr:`quitting` attribute to True. This raises :exc:`BdbQuit` in the next call to one of the :meth:`dispatch_\*` methods.
pl: Ustaw właściwość :attr:`quitting` na Prawdę. To zgłasza :exc:`BdbQuit` w następnym wywołaniu na jeden ze sposobów postępowania :meth:`dispatch_\*`

source: Derived classes and clients can call the following methods to manipulate breakpoints. These methods return a string containing an error message if something went wrong, or ``None`` if all is well.
pl: Pochodne uogólnienia i klienci mogą wywoływać następujące sposoby postępowania aby zmieniać punkty przerywania wykonania programu. Te sposoby postępowania zwracają ciąg zawierający wiadomość o błędzie jeśli coś poszło nie tak, lub ``None`` jeśli wszystko jest w porządku.

source: Set a new breakpoint. If the *lineno* line doesn't exist for the *filename* passed as argument, return an error message. The *filename* should be in canonical form, as described in the :meth:`canonic` method.
pl: Ustaw nowy punkt przerywania wykonania programu. Jeśli linia *lineno* nie istnieje fla pliku *filename* przekazywanego jako parametr, zwróć wiadomość o błędzie. Nazwa pliku - z ang. - *filename* powinna być w kanonicznej formie, jak opisano w sposobie postępowania :meth:`canonic`.

source: Delete the breakpoints in *filename* and *lineno*. If none were set, an error message is returned.
pl: Skasuj punkty przerywania programu w *nazwie pliku* i numer linii - z ang. - *lineno*. Jeśli żadne nie zostały ustawione, wiadomość o błędzie jest zwracana.

source: Delete the breakpoint which has the index *arg* in the :attr:`Breakpoint.bpbynumber`. If *arg* is not numeric or out of range, return an error message.
pl: Skasuj punkt przerywania programu który ma indeks *arg* w :attr:`Breakpoint.bpbynumber`. Jeśli *arg* jest nie numeryczny lub poza zakresem, zwróć wiadomość o błędzie.

source: Delete all breakpoints in *filename*. If none were set, an error message is returned.
pl: Skasuj wszystkie punkty przerywania programu w pliku *nazwa pliku* - z ang. *filename*. Jeśli żadne nie zostały ustawione, wiadomość o błędzie jest zwracana.

source: Delete all existing breakpoints.
pl: Skasuj wszystkie istniejące punkty przerywania wykonania programu.

source: Check if there is a breakpoint for *lineno* of *filename*.
pl: Sprawdź czy jest punkt przerywania programu dla *lineno* - z ang. - *numeru linii* pliku *nazwa pliku*.

source: Return all breakpoints for *lineno* in *filename*, or an empty list if none are set.
pl: Zwróć wszystkie punkty przerywania wykonania programu dla danego *lineno* w pliku *nazwa pliku* - z ang. - *filename* lub pustą listę jeśli żaden nie został ustawiony.

source: Return all breakpoints in *filename*, or an empty list if none are set.
pl: Zwróć wszystkie punkty przerywania wykonania programu w *nazwie pliku*, lub pustą listę jeśli żaden nie został ustawiony.

source: Return all breakpoints that are set.
pl: Zwróć wszystkie punkty przerywania wykonania programu które są ustawione.

source: Derived classes and clients can call the following methods to get a data structure representing a stack trace.
pl: Dziedziczące uogólnienia i klienci mogą wywoływać następujące sposoby postępowania aby uzyskać struktury danych reprezentujące ślad wywołań ze sterty wywołań.

source: Get a list of records for a frame and all higher (calling) and lower frames, and the size of the higher part.
pl: Pobierz listę zapisów dla ramki i wszystkich powyżej (wywołań) i poniżej ramek, i rozmiar wyższej części.

source: Return a string with information about a stack entry, identified by a ``(frame, lineno)`` tuple:
pl: Zwróć ciąg znaków z informacją o wpisie na stosie, identyfikowaną przez krotkę ``(ramka, lineno)`` :

source: The canonical form of the filename which contains the frame.
pl: Kanoniczna postać nazwy pliku, który zawiera ramkę.

source: The function name, or ``"<lambda>"``.
pl: Nazwa zadania, lub ``"<lambda>"``.

source: The input arguments.
pl: Parametry wejściowe.

source: The return value.
pl: Wartość zwracana.

source: The line of code (if it exists).
pl: Linia kodu (jeśli istnieje).

source: The following two methods can be called by clients to use a debugger to debug a :term:`statement`, given as a string.
pl: Następujące dwa sposoby postępowania mogą być wywoływane przez klientów aby użyć odpluskwiania aby odpluskwić :term:`statement` - z ang. - :term:`stwierdzenie`, dane jako ciąg znaków.

source: Debug a statement executed via the :func:`exec` function. *globals* defaults to :attr:`__main__.__dict__`, *locals* defaults to *globals*.
pl: Odpluskwiaj wyrażenie wykonywane przez zadanie :func:`exec`. *globals* domyślnie równa się :attr:`__main__.__dict__`, *locals* domyślnie równe jest *globals*.

source: Debug an expression executed via the :func:`eval` function. *globals* and *locals* have the same meaning as in :meth:`run`.
pl: Odpluskwiaj wyrażenie wykonywane przez zadanie :func:`eval`. *globals* i *locals* mają to same znaczenie jak w sposobie postępowania :meth:`run`.

source: For backwards compatibility. Calls the :meth:`run` method.
pl: Dla zgodności wstecznej. Wywołuje sposób postępowania :meth:`run`.

source: Debug a single function call, and return its result.
pl: Odpluskwiaj pojedyncze wywołanie zadania, i zwróć jego wynik.

source: Finally, the module defines the following functions:
pl: Ostatecznie moduł definiuje następujące zadania:

source: Check whether we should break here, depending on the way the breakpoint *b* was set.
pl: Sprawdź czy powinniśmy przerwać tutaj, w zależności od sposobu w jaki punkt przerywania *b* został ustawiony.

source: If it was set via line number, it checks if ``b.line`` is the same as the one in the frame also passed as argument. If the breakpoint was set via function name, we have to check we are in the right frame (the right function) and if we are in its first executable line.
pl: Jeśli został ustawiony przez numer linii, sprawdza czy ``b.line`` jest tożsame jak to w ramce także przekazywane jako parametr. Jeśli punkt przerywania wykonania programu został ustawiony przez nazwę zadania musimy sprawdzić czy jesteśmy we właściwej ramce (właściwym zadaniu) i czy jesteśmy w jego pierwszej wykonywalnej linii.

source: Determine if there is an effective (active) breakpoint at this line of code. Return breakpoint number or 0 if none.
pl: Sprawdź czy istnieje efektywny (aktywny) punkt przerywania wykonania programu w tej linii kodu. Zwróć punkt przerywania wykonania programu lub 0 jeśli żaden nie występuje.

source: Called only if we know there is a breakpoint at this location. Returns the breakpoint that was triggered and a flag that indicates if it is ok to delete a temporary breakpoint.
pl: Wywoływane tylko jeśli wiemy, że jest punkt przerywania wykonania programu w tej lokalizacji. Zwróć punkt przerywania wykonania programu który został potrącony i flagę która wskazuje czy można skasować tymczasowy punkt przerywania wykonania programu.

source: Starts debugging with a :class:`Bdb` instance from caller's frame.
pl: Zaczyna odpluskwianie z przykładem uogólnienia :class:`Bdb` z ramki wywołującego.

source: :mod:`binascii` --- Convert between binary and ASCII
pl: :mod:`binascii` --- Zamień pomiędzy binary a kodem ASCII

source: The :mod:`binascii` module contains a number of methods to convert between binary and various ASCII-encoded binary representations. Normally, you will not use these functions directly but use wrapper modules like :mod:`uu`, :mod:`base64`, or :mod:`binhex` instead. The :mod:`binascii` module contains low-level functions written in C for greater speed that are used by the higher-level modules.
pl: moduł :mod:`binascii` zawiera liczbę sposobów postępowania aby zamienić pomiędzy reprezentacją binarną a różnymi zakodowanymi-w-ASCII. Zwykle nie używasz tych zadań bezpośrednio ale używa modułów opakowania takich jak :mod:`uu`, :mod:`base64` lub :mod:`binhex` zamiast tego jednego. Moduł :mod:`binascii` zawiera nisko-poziomowe zadania napisane w C dla wyższych prędkości które są używane przez wyższego-poziomu moduły.

source: The :mod:`binascii` module defines the following functions:
pl: Moduł :mod:`binascii` definiuje następujące zadania:

source: Convert a single line of uuencoded data back to binary and return the binary data. Lines normally contain 45 (binary) bytes, except for the last line. Line data may be followed by whitespace.
pl: Zamień pojedynczą linię zakodowanych danych uu z powrotem do postaci binarnej i zwróć binarne dane. Linie zwykle zawierają 45 (binarnych) bajtów, z wyjątkiem ostatniej linii. Po linii danych mogą następować białe znaki.

source: Convert binary data to a line of ASCII characters, the return value is the converted line, including a newline char. The length of *data* should be at most 45.
pl: Zamień dane binarne na linię znaków ASCII, zwracana wartość jest konwertowaną linią, zawierając w tym znak nowego wiersza. Długość *danych* - z ang. - *data* powinna być najwięcej 45.

source: Convert a block of base64 data back to binary and return the binary data. More than one line may be passed at a time.
pl: Zamień blok danych base64 na binarne i zwróć dane binarne. Więcej niż jedna linia może być przekazywana na raz.

source: Convert binary data to a line of ASCII characters in base64 coding. The return value is the converted line, including a newline char. The length of *data* should be at most 57 to adhere to the base64 standard.
pl: Zamień binarne dane do linii znaków ASCII w kodowaniu base64. Zwracana wartość jest zamienioną linią zawierając znak nowego wiersza. Długość *danych* - z ang. - *data* powinien być najdłużej 57 aby dostosować się do standardu base64.

source: Convert a block of quoted-printable data back to binary and return the binary data. More than one line may be passed at a time. If the optional argument *header* is present and true, underscores will be decoded as spaces.
pl: Zamień blok cytowanych-drukowalnych danych spowrotem do binarnych i zwróć dane binarne. Więcej niż jedna linia może być przekazywana na raz. Jeśli opcjonalny parametr *nagłówek* jest obecny i prawdziwy, podkreślenia będą zdekodowane jako odstępy.

source: Convert binary data to a line(s) of ASCII characters in quoted-printable encoding. The return value is the converted line(s). If the optional argument *quotetabs* is present and true, all tabs and spaces will be encoded. If the optional argument *istext* is present and true, newlines are not encoded but trailing whitespace will be encoded. If the optional argument *header* is present and true, spaces will be encoded as underscores per RFC1522. If the optional argument *header* is present and false, newline characters will be encoded as well; otherwise linefeed conversion might corrupt the binary data stream.
pl: Zamień dane binarne na linię znaków ASCII zakodowanych w cudzysłowach drukowalnych. Wartość zwracana jest zamienioną linią(ami). Jeśli opcjonalny parametr *quotetabs* jest obecny i prawdziwy, wszystkie tabulacje i odstępy zostaną zakodowane. Jeśli opcjonalny parametr *istext* jest obecny i prawdziwy, znaki nowego wiersza nie są kodowane ale kończące białe znaki zostaną zakodowane. Jeśli opcjonalny parametr *nagłówka* jest obecny i prawdziwy, odstępy będą zakodowane jako podkreślenia zgodne z RFC 1522. Jeśli opcjonalny parametr *nagłówka* - z ang. - *header* jest obecny i fałszywy, znaki nowego wiersza zostaną zakodowane także; w przeciwnym razie zamiana znaków nowego wiersza może popsuć binarny strumień danych.

source: Convert binhex4 formatted ASCII data to binary, without doing RLE-decompression. The string should contain a complete number of binary bytes, or (in case of the last portion of the binhex4 data) have the remaining bits zero.
pl: Skonwertuj sformatowane binhex4 dane ASCII do danych binarnych bez wykonywania dekompresji-RLE. Ciąg powinien zawierać pełną liczbę bajtów binarnych, lub (w przypadku ostatniej porcji danych binhex4) mieć pozostałe bity wyzerowane.

source: Perform RLE-decompression on the data, as per the binhex4 standard. The algorithm uses ``0x90`` after a byte as a repeat indicator, followed by a count. A count of ``0`` specifies a byte value of ``0x90``. The routine returns the decompressed data, unless data input data ends in an orphaned repeat indicator, in which case the :exc:`Incomplete` exception is raised.
pl: Wykonaj dekompresję-RLE na danych, zgodnie ze standardem binhex4. Algorytm używa ``0x90`` po bajcie jako wskaźnik powtórzenia, po którym następuje zliczana liczba. Wartość zliczona ``0`` określa wartość bajtu ``0x90``. Zadanie zwraca rozpakowane dane, chyba że dane wejściowe kończą się osamotnionym wskazaniem powtórzenia, w którym to przypadku zgłaszany jest wyjątek :exc:`Niekompletny` - z ang. - :exc:`Incomplete`.

source: Perform binhex4 style RLE-compression on *data* and return the result.
pl: Wykonaj kompresję RLE w stylu binhex4 na *danych* - z ang. - *data* i zwróć wynik.

source: Perform hexbin4 binary-to-ASCII translation and return the resulting string. The argument should already be RLE-coded, and have a length divisible by 3 (except possibly the last fragment).
pl: Wykonaj tłumaczenie hexbin4 binarne-do-ASCII i zwróć wynikły ciąg znaków. Parametr powinien być już zakodowany kodem RLE, i mieć długość podzielną przez 3 (z wyjątkiem możliwie ostatniego fragmentu).

source: Compute the binhex4 crc value of *data*, starting with an initial *crc* and returning the result.
pl: Oblicz wartość crc binhex4 *danych*, zaczynając z początkowym *crc* i zwracając wynik

source: Compute CRC-32, the 32-bit checksum of data, starting with an initial crc. This is consistent with the ZIP file checksum. Since the algorithm is designed for use as a checksum algorithm, it is not suitable for use as a general hash algorithm. Use as follows::
pl: Oblicz CRC-32, 32-bitową sumę kontrolną danych zaczynając z początkowym crc. To jest zgodne z sumą kontrolną plików ZIP. Od kiedy algorytm jest zaprojektowany dla użycia jako algorytm sprawdzania sumy kontrolnej, nie jest on odpowiedni dla użycia jako ogólny algorytm hash-owania. Używaj jak następuje::

source: print(binascii.crc32(b"hello world")) # Or, in two pieces: crc = binascii.crc32(b"hello") crc = binascii.crc32(b" world", crc) & 0xffffffff print('crc32 = {:#010x}'.format(crc))
pl: print(binascii.crc32(b"witaj świecie)) # Lub, w dwóch kawałkach: crc = binascii.crc32(b"witaj") crc = binascii.crc32(b" świecie", crc) & 0xffffffff print('crc32 = {:#010x}'.format(crc))

source: To generate the same numeric value across all Python versions and platforms use crc32(data) & 0xffffffff. If you are only using the checksum in packed binary format this is not necessary as the return value is the correct 32bit binary representation regardless of sign.
pl: Aby wygenerować tą samą wartość numeryczną we wszystkich wersjach języka pytonowskiego i wszystkich maszynach/środowiskach używaj crc32(dane) & 0xffffffff. Jeśli tylko używasz sumy kontrolnej w spakowanej binarnej postaci to nie jest konieczne jako że wartość zwracana jest poprawną 32bitową binarną reprezentacją niezależną od znaku.

source: Return the hexadecimal representation of the binary *data*. Every byte of *data* is converted into the corresponding 2-digit hex representation. The resulting string is therefore twice as long as the length of *data*.
pl: Zwróć heksadecymalną reprezentację *danych* binarnych. Każdy bajt *danych* jest konwertowany do odpowiadającego 2-cyfrowej reprezentacji heksadecymalnej. Wynikający ciąg znaków jest z tego też powodu dwukrotnie dłuższy od długości *danych*.

source: Return the binary data represented by the hexadecimal string *hexstr*. This function is the inverse of :func:`b2a_hex`. *hexstr* must contain an even number of hexadecimal digits (which can be upper or lower case), otherwise a :exc:`TypeError` is raised.
pl: Zwróć binarną reprezentację danych przez heksadecymalny ciąg znaków *hexstr*. To zadanie jest przeciwnym do :func:`b2a_hex`. *hexstr* musi zawierać parzystą liczbę heksadecymalnych cyfr (które mogą być dużymi lub małymi literami), w przeciwnym razie wyjątek :exc:`TypeError` jest zgłaszany.

source: Exception raised on errors. These are usually programming errors.
pl: Wyjątek zgłaszany przy błędach. Istnieją zwykle błędy programowania.

source: Exception raised on incomplete data. These are usually not programming errors, but may be handled by reading a little more data and trying again.
pl: Wyjątek zgłaszany przy niekompletnych danych. Te nie są zwykle błędami programowania, ale mogą być obsługiwane przez wczytanie odrobiny więcej danych i próbując jeszcze raz.

source: Support for base64 encoding used in MIME email messages.
pl: Wsparcie dla kodowania base64 w wiadomościach email MIME.

source: Support for the binhex format used on the Macintosh.
pl: Wsparcie dla formatu binhex używanego na Macintoshu.

source: Support for UU encoding used on Unix.
pl: Wsparcie dla kodowania UU używanego na Unixie.

source: Support for quoted-printable encoding used in MIME email messages.
pl: Wsparcie dla cytowanych-drukowalnych kodowań używanych w wiadomościach email typu MIME.

source: :mod:`binhex` --- Encode and decode binhex4 files
pl: :mod:`binhex` --- Koduj i dekoduj pliki binhex4

source: This module encodes and decodes files in binhex4 format, a format allowing representation of Macintosh files in ASCII. Only the data fork is handled.
pl: Ten moduł koduje i dekoduje pliki w formacie binhex4, formacie pozwalającym reprezentację plików Macintosha w ASCII. Tylko rozwidlenie danych jest obsługiwane.

source: The :mod:`binhex` module defines the following functions:
pl: moduł :mod:`binhex` definiuje następujące zadania:

source: Convert a binary file with filename *input* to binhex file *output*. The *output* parameter can either be a filename or a file-like object (any object supporting a :meth:`write` and :meth:`close` method).
pl: Zamień plik binarny z nazwą pliku *input* do pliku binhex *output*. Parametr *output* może albo być nazwą pliku lub przedmiotem podobnym do pliku (dowolny przedmiot wspierający sposoby postępowania :meth:`write` - z ang. - :meth:`zapisz` i :meth:`close` - z ang. - :meth:`zamknij`).

source: Decode a binhex file *input*. *input* may be a filename or a file-like object supporting :meth:`read` and :meth:`close` methods. The resulting file is written to a file named *output*, unless the argument is ``None`` in which case the output filename is read from the binhex file.
pl: Dekoduj plik binhex *input*. *input* może być nazwą pliku lub przedmiotem podobnym do pliku wspierającym sposoby postępowania :meth:`read` i :meth:`close`. Wynikający plik jest zapisywany do pliku nazwanego *output*, chyba, że parametr jest ``None`` - z ang. - ``Żaden`` w którym przypadku nazwa pliku jest wczytywana z pliku binhex.

source: The following exception is also defined:
pl: Następujący wyjątek jest także zdefiniowany:

source: Exception raised when something can't be encoded using the binhex format (for example, a filename is too long to fit in the filename field), or when input is not properly encoded binhex data.
pl: Wyjątek zgłaszany gdy coś nie może być zakodowane używając formatu binhex (dla przykładu, nazwa pliku jest za długa aby dopasować do pola nazwy pliku), lub gdy wejście nie jest poprawnie zakodowanymi danymi binhex.

source: Notes
pl: Uwagi

source: There is an alternative, more powerful interface to the coder and decoder, see the source for details.
pl: Istnieje alternatywny, bardziej silny sprzęg kodera i dekodera, zobacz źródło dla szczegółów.

source: If you code or decode textfiles on non-Macintosh platforms they will still use the old Macintosh newline convention (carriage-return as end of line).
pl: Jeśli kodujesz lub dekodujesz pliki tekstowe na maszynie/środowisku nie-Macintoshu one będą wciąż używały starej konwencji znaków nowego wiersza z Macintosha (powrót-karetki jako końca linii).

source: As of this writing, :func:`hexbin` appears to not work in all cases.
pl: W momencie pisania tego zadanie :func:`hexbin` sprawia wrażenie nie działającej we wszystkich przypadkach.

source: :mod:`bisect` --- Array bisection algorithm
pl: :mod:`bisect` --- algorytm bisekcji tablicy
